tsung/20180118-2238/mqtt-example.xml
<?xml version="1.0"?><tsung loglevel="debug">
    <clients>
        <client host="localhost" cpu="1" maxusers="30000" use_controller_vm="true"/>
    </clients>

    <servers>
        <server host="a205s9oarssudz.iot.us-west-2.amazonaws.com" port="8883" type="ssl"/>
    </servers>

     <load>
        <arrivalphase phase="1" duration="3" unit="minute">
            <users arrivalrate="1" unit="second"/>
        </arrivalphase>
    </load>
    <sessions>
        <session name="mqtt_publisher" probability="100" type="ts_mqtt">
            <set_option name="certificate">
                <certificate cacertfile="/Users/vincentjoe/Downloads/root-CA.crt" keyfile="/Users/vincentjoe/Downloads/mac-test.private.key" keypass="" certfile="/Users/vincentjoe/Downloads/mac-test.cert.pem"/>
            </set_option>
            <request>
                <mqtt type="connect" clean_start="true" keepalive="10000" will_topic="will_topic" will_qos="0" will_msg="will_msg" will_retain="false"/>
            </request>
            <thinktime value="30"/> 
            <request subst="true">
                <mqtt type="publish" topic="test_topic" qos="0" retained="false">test_message from TSUNG</mqtt>
            </request>
            <thinktime value="30"/> 

        </session>
    </sessions>
    
</tsung>